In [27]:
path = "/media/floricslimani/SSD4To/SSD_floricslimani/Fish_seq/Davide/2024-08-12 - SeqFISH - HeLa - Puro - R2TP1-2_Run7_fake/result_tables"

In [28]:
import pandas as pd
Acquisition = pd.read_feather(path + "/Acquisition.feather")
Cell = pd.read_feather(path + "/Cell.feather")
Clusters = pd.read_feather(path + "/Clusters.feather")
Colocalisation = pd.read_feather(path + "/Colocalisation.feather")
Coloc_before_merge = pd.read_feather(path + "/Coloc_before_merge.feather")
Detection = pd.read_feather(path + "/Detection.feather")
Drift = pd.read_feather(path + "/Drift.feather")
Spots = pd.read_feather(path + "/Spots.feather")

In [6]:
path = "/media/floricslimani/SSD4To/SSD_floricslimani/Fish_seq/output/240429_time_course_CB_20241108_10-49-47/result_tables/"

In [9]:
Acquisition = pd.read_feather(path + "/Acquisition.feather")
Cell = pd.read_feather(path + "/Cell.feather")
Spots = pd.read_feather(path + "/Spots.feather")

In [25]:
Cell.columns
Cell['rna1_number'] = Cell['rna1_nb_rna_in_nuc'] + Cell['rna1_nb_rna_out_nuc']
Cell['rna1_number']
sub_data = Cell.set_index('cell_id',verify_integrity=True).loc[:,['rna1_number']]
sub_data

         rna1_number
cell_id
8               91.0
9              193.0
10             111.0
11             219.0
13             125.0
...              ...
3809           255.0
3810           245.0
3811           288.0
3812           193.0
3813           302.0

[3186 rows x 1 columns]

In [26]:
spots_grouped = Spots.groupby('cell_id')['spots_id'].count()
sub_data = sub_data.join(spots_grouped)
sub_data['test'] = sub_data['rna1_number'].eq(sub_data['spots_id'])
sub_data

         rna1_number  spots_id  test
cell_id
8.0             91.0      91.0  True
9.0            193.0     193.0  True
10.0           111.0     111.0  True
11.0           219.0     219.0  True
13.0           125.0     125.0  True
...              ...       ...   ...
3809.0         255.0     255.0  True
3810.0         245.0     245.0  True
3811.0         288.0     288.0  True
3812.0         193.0     193.0  True
3813.0         302.0     302.0  True

[3186 rows x 3 columns]